In [1]:
import pandas as pd
import numpy as np

In [7]:
df = pd.DataFrame({"Name":["Ankit","Amit","Aishwarya","Priyanka","Priya","Shaurya"],"Age":[21,19,20,18,17,21],"Stream":["Math","Commerce","Science","Math","Math","Science"],"Percentage":[88,92,95,70,65,78]})

In [8]:
df

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

In [14]:
df1=df[df["Stream"].isin(["Math","Commerce"])]
df1

       Name  Age    Stream  Percentage
0     Ankit   21      Math          88
1      Amit   19  Commerce          92
3  Priyanka   18      Math          70
4     Priya   17      Math          65

In [ ]:
df2 = df[df["Stream"]!="Science"]
df2u

       Name  Age    Stream  Percentage
0     Ankit   21      Math          88
1      Amit   19  Commerce          92
3  Priyanka   18      Math          70
4     Priya   17      Math          65

In [22]:
df3 = df[df["Stream"].isin(["Math"]) & df["Age"]<20]
df3

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

In [24]:
a=df["Stream"].isin(["Science","Commerce"]).sum()
a

np.int64(3)

In [32]:
b = df[df["Stream"].isin(["Science"])]
b

        Name  Age   Stream  Percentage
2  Aishwarya   20  Science          95
5    Shaurya   21  Science          78

In [35]:
b.max()

Name          Shaurya
Age                21
Stream        Science
Percentage         95
dtype: object